NDBCK/stm8flash_dump/main.c
	if(is_ext(filename, ".ihx") || is_ext(filename, ".hex") || is_ext(filename, ".i86"))
		fileformat = INTEL_HEX;
	else if(is_ext(filename, ".s19") || is_ext(filename, ".s8") || is_ext(filename, ".srec"))
		fileformat = MOTOROLA_S_RECORD;
	fprintf(stderr, "Due to its file extension (or lack thereof), \"%s\" is considered as %s format!\n", filename, fileformat == INTEL_HEX ? "INTEL HEX" : (fileformat == MOTOROLA_S_RECORD ? "MOTOROLA S-RECORD" : "RAW BINARY"));


	if(action == TEST) {
		fprintf(stdout, "ROP: 0x%02X\n", ROP);
		if(ROP != 0xAA){	//Check if ROP protection is in place but deactivated by glitching
			if(ROP == 0x71){ //Certain that ROP is in place and activated
				fprintf(stdout, "Read Out Protection in place and active - dumping impossible\n");
			}
			else{	//ROP could be in place and active or no protection is in place.
				fprintf(stdout, "No Read Out Protection in place or Read Out Protection is activated - dumping disabled\n");
			}
		}
		else{
			fprintf(stdout, "Read Out Protection in place but inactive - dump all memory regions\n");
		
			int bytes_count_align;
			int recv;
				
			//FLASH
			start = part->flash_start;
			start_addr_specified = true;
			bytes_count = part->flash_size;
			FILE *fa;
			fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
			bytes_count_align = ((bytes_count-1)/256+1)*256; // Reading should be done in blocks of 256 bytes
			unsigned char *bufa = malloc(bytes_count_align);
			if(!bufa) spawn_error("malloc failed");
			recv = pgm->read_range(pgm, part, bufa, start, bytes_count_align);
			if(recv < bytes_count_align) {
				fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
				spawn_error("Failed to read MCU");
			}
			const char *suffixa = "_ROM";
			const char *rom_filename = add_suffix_to_filename(filename, suffixa);
			
			if(!(fa = fopen(rom_filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
				spawn_error("Failed to open file");
			switch(fileformat)
			{
			case INTEL_HEX:
				if(ihex_write(fa, bufa, start, start+bytes_count) < 0)
				  exit(-1);
				break;
			case MOTOROLA_S_RECORD:
				srec_write(fa, bufa, start, start+bytes_count);
				break;
			default:
				fwrite(bufa, 1, bytes_count, fa);
			}
			fclose(fa);
			fprintf(stdout, "Flash OK\n");

			//EEPROM
			start = part->eeprom_start;
			start_addr_specified = true;
			bytes_count = part->eeprom_size;
			FILE *fb;
			fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
			bytes_count_align = ((bytes_count-1)/256+1)*256; // Reading should be done in blocks of 256 bytes
			unsigned char *bufb = malloc(bytes_count_align);
			if(!bufb) spawn_error("malloc failed");
			recv = pgm->read_range(pgm, part, bufb, start, bytes_count_align);
			if(recv < bytes_count_align) {
				fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
				spawn_error("Failed to read MCU");
			}
			const char *suffixb = "_PROM";
			const char *prom_filename = add_suffix_to_filename(filename, suffixb);
			
			if(!(fb = fopen(prom_filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
				spawn_error("Failed to open file");
			switch(fileformat)
			{
			case INTEL_HEX:
				if(ihex_write(fb, bufb, start, start+bytes_count) < 0)
				  exit(-1);
				break;
			case MOTOROLA_S_RECORD:
				srec_write(fb, bufb, start, start+bytes_count);
				break;
			default:
				fwrite(bufb, 1, bytes_count, fb);
			}
			fclose(fb);
			fprintf(stdout, "EEPROM OK\n");
			
			//OPT
			start = 0x4800;
			start_addr_specified = true;
			size_t opt_size = (part->flash_size <= 8*1024 ? 0x40 : 0x80);
			bytes_count = opt_size;

			FILE *fc;
			fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
			bytes_count_align = ((bytes_count-1)/256+1)*256; // Reading should be done in blocks of 256 bytes
			unsigned char *bufc = malloc(bytes_count_align);
			if(!bufc) spawn_error("malloc failed");
			recv = pgm->read_range(pgm, part, bufc, start, bytes_count_align);
			if(recv < bytes_count_align) {
				fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
				spawn_error("Failed to read MCU");
			}
			const char *suffixc = "_OPT";
			const char *opt_filename = add_suffix_to_filename(filename, suffixc);
			
			if(!(fc = fopen(opt_filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
				spawn_error("Failed to open file");
			switch(fileformat)
			{
			case INTEL_HEX:
				if(ihex_write(fc, bufc, start, start+bytes_count) < 0)
				  exit(-1);
				break;
			case MOTOROLA_S_RECORD:
				srec_write(fc, bufc, start, start+bytes_count);
				break;
			default:
				fwrite(bufc, 1, bytes_count, fc);
			}
			fclose(fc);
			fprintf(stdout, "OPT OK\n");
			
			//RAM
			start = part->ram_start;
			start_addr_specified = true;
			bytes_count = part->ram_size;

			FILE *fd;
			fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
			bytes_count_align = ((bytes_count-1)/256+1)*256; // Reading should be done in blocks of 256 bytes
			unsigned char *bufd = malloc(bytes_count_align);
			if(!bufd) spawn_error("malloc failed");
			recv = pgm->read_range(pgm, part, bufd, start, bytes_count_align);
			if(recv < bytes_count_align) {
				fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
				spawn_error("Failed to read MCU");
			}
			const char *suffixd = "_RAM";
			const char *ram_filename = add_suffix_to_filename(filename, suffixd);
			
			if(!(fd = fopen(ram_filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
				spawn_error("Failed to open file");
			switch(fileformat)
			{
			case INTEL_HEX:
				if(ihex_write(fd, bufd, start, start+bytes_count) < 0)
				  exit(-1);
				break;
			case MOTOROLA_S_RECORD:
				srec_write(fd, bufd, start, start+bytes_count);
				break;
			default:
				fwrite(bufd, 1, bytes_count, fd);
			}
			fclose(fd);
			fprintf(stdout, "RAM OK\n");
			fprintf(stdout, "Dump Done\n");
		}
	}


	FILE *f;
	if(action == READ) {
		fprintf(stderr, "Reading %d bytes at 0x%x... ", bytes_count, start);
		int bytes_count_align = ((bytes_count-1)/256+1)*256; // Reading should be done in blocks of 256 bytes
		unsigned char *buf = malloc(bytes_count_align);
		if(!buf) spawn_error("malloc failed");
		int recv = pgm->read_range(pgm, part, buf, start, bytes_count_align);
		if(recv < bytes_count_align) {
			fprintf(stderr, "\r\nRequested %d bytes but received only %d.\r\n", bytes_count_align, recv);
			spawn_error("Failed to read MCU");
		}
		if(!(f = fopen(filename, (fileformat == RAW_BINARY) ? "wb" : "w")))
			spawn_error("Failed to open file");
		switch(fileformat)
		{
		case INTEL_HEX:
			if(ihex_write(f, buf, start, start+bytes_count) < 0)
			  exit(-1);
			break;
		case MOTOROLA_S_RECORD:
			srec_write(f, buf, start, start+bytes_count);
			break;
		default:
			fwrite(buf, 1, bytes_count, f);
		}
		fclose(f);
		fprintf(stderr, "OK\n");
		fprintf(stderr, "Bytes received: %d\n", bytes_count);
	} else if (action == VERIFY) {
		fprintf(stderr, "Verifing %d bytes at 0x%x... ", bytes_count, start);

